Tekla Open API Reference for Tekla Structures 2025
Rectangle Properties
The Rectangle type exposes the following members.
Properties
Name | Description
Angle
 The angle of the rectangle. The rectangle rotates around its start point.
Attributes
 The attributes of the rectangle.
EndPoint
 The end point of the rectangle.
Height
 The height of the rectangle. Changing the height changes the end point with the height.
Hideable
 Accesses the information if this object is hidden or not or if it should be.
 (Inherited from GraphicObject.)
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
StartPoint
 The start point of the rectangle. Changing this will move the rectangle.
Width
 The width of the rectangle. Changing the width changes the end point with the width.
Top
See Also
Reference
Rectangle Class
Tekla.Structures.Drawing Namespace